# read design with -SV option
#read_verilog -defer -overwrite -sv en_ff.sv clock_g.sv fibonacci_piped.sv

# read design with -SV option
read_verilog -sv fibonacci.sv

# generic define the top
#hierarchy -check -top fibonacci_piped
hierarchy -check -top fibonacci

# Process
proc
#fsm
#opt
#clean
#flatten
#proc
#simplemap
#memory -nomap
#wreduce -memx
#opt -full
#aigmap

# Dot view file
show -prefix view_file -notitle -colors 2 -width -format dot

# write json file
write_json result.json
